Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense (Dense)                (None, 200, 200, 128)     512       
_________________________________________________________________
flatten (Flatten)            (None, 5120000)           0         
_________________________________________________________________
dense_1 (Dense)              (None, 1)                 5120001   
=================================================================
Total params: 5,120,513
Trainable params: 5,120,513
Non-trainable params: 0
_________________________________________________________________
