Model: "sequential_3"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_24 (Conv2D)           (None, 198, 198, 32)      896       
_________________________________________________________________
conv2d_25 (Conv2D)           (None, 196, 196, 32)      9248      
_________________________________________________________________
max_pooling2d_12 (MaxPooling (None, 98, 98, 32)        0         
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 96, 96, 64)        18496     
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 94, 94, 64)        36928     
_________________________________________________________________
max_pooling2d_13 (MaxPooling (None, 47, 47, 64)        0         
_________________________________________________________________
conv2d_28 (Conv2D)           (None, 45, 45, 128)       73856     
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 43, 43, 128)       147584    
_________________________________________________________________
max_pooling2d_14 (MaxPooling (None, 21, 21, 128)       0         
_________________________________________________________________
conv2d_30 (Conv2D)           (None, 19, 19, 256)       295168    
_________________________________________________________________
conv2d_31 (Conv2D)           (None, 17, 17, 256)       590080    
_________________________________________________________________
max_pooling2d_15 (MaxPooling (None, 8, 8, 256)         0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 16384)             0         
_________________________________________________________________
dense_9 (Dense)              (None, 256)               4194560   
_________________________________________________________________
dropout_6 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 256)               65792     
_________________________________________________________________
dropout_7 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_11 (Dense)             (None, 1)                 257       
_________________________________________________________________
activation_3 (Activation)    (None, 1)                 0         
=================================================================
Total params: 5,432,865
Trainable params: 5,432,865
Non-trainable params: 0
_________________________________________________________________
